ua1arn/hftrx/boards/arm_stm32mp1xx_ctlstyle_storch_v9a_R1AQ.h
/* $Id$ */
/* board-specific CPU attached signals */
//
// Проект HF Dream Receiver (КВ приёмник мечты)
// автор Гена Завидовский mgs2001@mail.ru
// UA1ARN
//
// Трансивер с DSP обработкой "Аист" на процессоре STM32MP1xx
// rmainunit_v5km7.pcb STM32MP1xx, 2xUSB, NAU8822L и FPGA EP4CE22E22I7N

#ifndef ARM_STM32MP1_LFBGA354_CTLSTYLE_STORCH_V9A_H_INCLUDED
#define ARM_STM32MP1_LFBGA354_CTLSTYLE_STORCH_V9A_H_INCLUDED 1

	#if ! defined(STM32MP153Dxx)
		#error Wrong CPU selected. STM32MP153Dxx expected
	#endif /* ! defined(STM32MP153Dxx) */

	//#define WITHSAICLOCKFROMI2S 1	/* Блок SAI1 тактируется от PLL I2S */
	// в данной конфигурации I2S и SAI - в режиме SLAVE
	#define WITHI2SCLOCKFROMPIN 1	// тактовая частота на SPI2 (I2S) подается с внешнего генератора, в процессор вводится через MCK сигнал интерфейса
	#define WITHSAICLOCKFROMPIN 1	// тактовая частота на SAI1 подается с внешнего генератора, в процессор вводится через MCK сигнал интерфейса

	#define WITHUSEPLL		1	/* Главная PLL	*/
	#define WITHUSEPLL1		1	/* PLL1 - MPU, AXI	*/
	#define WITHUSEPLL2		1	/* PLL2 - GPU, DDR	*/
	//#define WITHUSEPLL3		1	/* PLL3 - для LTDC на STM32H743xx	*/
	#define WITHUSEPLL4		1	/* PLL4 - для LTDC & USBPHY	*/
	//#define WITHUSESAIPLL	1	/* SAI PLL	*/
	//#define WITHUSESAII2S	1	/* I2S PLL	*/

	#define LSEFREQ 32768uL
	#define WITHCPUXTAL 24000000uL	/* На процессоре установлен кварц 24.000 МГц */
	//#define WITHCPUXOSC 24000000uL	/* На процессоре установлен генератор 24.000 МГц */

	#if WITHISBOOTLOADER
		// Варианты конфигурации тактирования
		// ref1_ck, ref2_ck - 8..16 MHz
		// PLL1, PLL2 VCOs
		#if WITHCPUXTAL || 24000000uL

			// PLL1_1600
			#define PLL1DIVM	2	// ref1_ck = 12 MHz
			#define PLL1DIVP	1	// MPU
			#define PLL1DIVQ	2
			#define PLL1DIVR	2

			//#define PLL1DIVN	54	// 12*54 = 648 MHz
			//#define PLL1DIVN	66	// 12*66 = 792 MHz
			#define PLL1DIVN	(stm32mp1_overdrived() ? 66 : 54)	// Auto select

			// PLL2_1600
	#if 1
			#define PLL2DIVM	2	// ref2_ck = 12 MHz
			#define PLL2DIVN	44	// 528 MHz Valid division rations for DIVN: between 25 and 100
			#define PLL2DIVP	2	// AXISS_CK div2=minimum 528/2 = 264 MHz PLL2 selected as AXI sub-system clock (pll2_p_ck) - 266 MHz max for all CPU revisions
			#define PLL2DIVQ	1	// GPU clock divider = 528 MHz - 533 MHz max for all CPU revisions
			#define PLL2DIVR	1	// DDR clock divider = 528 MHz
	#elif 0
			#define PLL2DIVM	2	// ref2_ck = 12 MHz
			#define PLL2DIVN	66	// 528 MHz Valid division rations for DIVN: between 25 and 100
			#define PLL2DIVP	3	// AXISS_CK div2=minimum 528/2 = 264 MHz PLL2 selected as AXI sub-system clock (pll2_p_ck) - 266 MHz max for all CPU revisions
			#define PLL2DIVQ	2	// GPU clock divider = 528 MHz - 533 MHz max for all CPU revisions
			#define PLL2DIVR	2	// DDR clock divider = 528 MHz
	#else
			/* bad boards DDR3 clock = 300 MHz */
			#define PLL2DIVM	2	// ref2_ck = 12 MHz
			#define PLL2DIVN	50	// 600 MHz Valid division rations for DIVN: between 25 and 100
			#define PLL2DIVP	3	// AXISS_CK div2=minimum 1056/4 = 200 MHz PLL2 selected as AXI sub-system clock (pll2_p_ck) - 266 MHz max for all CPU revisions
			#define PLL2DIVQ	2	// GPU clock divider = 300 MHz - 533 MHz max for all CPU revisions
			#define PLL2DIVR	2	// DDR clock divider = 300 MHz
	#endif

			// PLL3_800

			// PLL4_800
			#define PLL4DIVM	2	// ref2_ck = 12 MHz
			#define PLL4DIVN	64	// 768 MHz
			#define PLL4DIVP	2	// div2
			//#define PLL4DIVQ	19	// LTDC clock divider = 30.315 MHz
			//#define PLL4DIVR	20	// USBPHY clock divider = 38.4 MHz
			//#define PLL4DIVR	24	// USBPHY clock divider = 32 MHz
			//#define PLL4DIVR	32	// USBPHY clock divider = 24 MHz
			#define PLL4DIVR	16	// USBPHY clock divider = 48 MHz (для прямого тактирования USB_OTG FS)

		#else
			// HSI version (HSI=64 MHz)
			// PLL1_1600
			#define PLL1DIVM	5	// ref1_ck = 12.8 MHz
			#define PLL1DIVP	1	// MPU
			#define PLL1DIVQ	2
			#define PLL1DIVR	2
			//#define PLL1DIVN	50	// x25..x100: 12.8 * 50 = 640 MHz
			//#define PLL1DIVN	62	// x25..x100: 12.8 * 62 = 793.6 MHz
			#define PLL1DIVN	(stm32mp1_overdrived() ? 62 : 50)	// Auto select

	#if 1
			// PLL2_1600
			#define PLL2DIVM	5	// ref2_ck = 12.8 MHz
			#define PLL2DIVN	41	// 12.8 * 41 = 524.8 MHz
			#define PLL2DIVP	2	// div2=minimum PLL2 selected as AXI sub-system clock (pll2_p_ck)
			#define PLL2DIVQ	1	// GPU clock divider
			#define PLL2DIVR	1	// DDR clock divider
	#else
			// PLL2_1600
			#define PLL2DIVM	5	// ref2_ck = 12.8 MHz
			#define PLL2DIVN	61//41	// 12.8 * 41 = 524.8 MHz
			#define PLL2DIVP	3//2	// div2=minimum PLL2 selected as AXI sub-system clock (pll2_p_ck)
			#define PLL2DIVQ	2//1	// GPU clock divider
			#define PLL2DIVR	3//1	// DDR clock divider
	#endif

			// PLL3_800
			// pll3_p_ck -> mcuss_ck - 209 MHz Max
			#define PLL3DIVM	5	// ref2_ck = 12.8 MHz

			// PLL4_800
			#define PLL4DIVM	5	// ref2_ck = 12.8 MHz
			#define PLL4DIVN	60	// 12.8 * 60 = 768 MHz
			#define PLL4DIVP	2	// div2
			//#define PLL4DIVR	20	// USBPHY clock divider = 38.4 MHz
			//#define PLL4DIVR	24	// USBPHY clock divider = 32 MHz
			//#define PLL4DIVR	32	// USBPHY clock divider = 24 MHz
			#define PLL4DIVR	16	// USBPHY clock divider = 48 MHz (для прямого тактирования USB_OTG FS)

		#endif
	#endif /* WITHISBOOTLOADER */

	/* модели синтезаторов - схемы частотообразования */

	/* Версии частотных схем - с преобразованием "наверх" */
	//#define FQMODEL_45_IF8868_UHF430	1	// SW2011
	//#define FQMODEL_73050		1	// 1-st IF=73.050, 2-nd IF=0.455 MHz
	//#define FQMODEL_73050_IF0P5		1	// 1-st IF=73.050, 2-nd IF=0.5 MHz
	//#define FQMODEL_80455		1	// 1-st IF=80.455, 2-nd IF=0.455 MHz
	//#define FQMODEL_64455_IF0P5		1	// 1-st IF=64.455, 2-nd IF=0.5 MHz
	//#define FQMODEL_70455		1	// 1-st IF=70.455, 2-nd IF=0.455 MHz
	//#define FQMODEL_70200		1	// 1-st if = 70.2 MHz, 2-nd IF-200 kHz
	//#define FQMODEL_60700_IF05	1	// 60.7 -> 10.7 -> 0.5
	//#define FQMODEL_60725_IF05	1	// 60.725 -> 10.725 -> 0.5
	//#define FQMODEL_60700_IF02	1	// 60.7 -> 10.7 -> 0.2
	//#define FQMODEL_70200		1	// 1-st if = 70.2 MHz, 2-nd IF-200 kHz

	// +++ вариации прошивки, специфические для разных частот опорного генератора
	#if 0
		//#define DIRECT_50M0_X1		1	/* Тактовый генератор на плате 50.0 МГц */
		#define DIRECT_80M0_X1		1	/* Тактовый генератор на плате 80.0 МГц */
		//#define DIRECT_72M595_X1	1	/* Тактовый генератор 75.595 МГц */
		#define BANDSELSTYLERE_UPCONV56M_36M	1	/* Up-conversion with working band .030..36 MHz */
	#elif 0
		#define DIRECT_100M0_X1		1	/* Тактовый генератор на плате 100.0 МГц */
		#define BANDSELSTYLERE_UPCONV56M_45M	1	/* Up-conversion with working band .030..45 MHz */
	#else
		//#define DIRECT_125M0_X1		1	/* Тактовый генератор на плате 125.0 МГц */
		#define DIRECT_122M88_X1	1	/* Тактовый генератор 122.880 МГц */
		#define BANDSELSTYLERE_UPCONV56M	1	/* Up-conversion with working band .030..56 MHz */
	#endif
	#define FQMODEL_FPGA		1	// FPGA + IQ over I2S
	//#define XVTR_NYQ1			1	// Support Nyquist-style frequency conversion

	// --- вариации прошивки, специфические для разных частот

